# Assignment: Preparing Data for Analysis (Modified Titanic)

![](https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/%20files/hw.png)

# 1) Load data & review the data

How many rows are there in the "titanic_to_student.csv"?

In [412]:
#Import the libraries
import numpy as np
import pandas as pd

In [413]:
df = pd.read_csv("titanic_to_student.csv")
df.shape

(445, 13)

In [414]:
df

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
1,1,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
2,2,6,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,NaN,Q
3,3,8,0.0,3.0,"Palsson, Master. Gosta Leonard",male,2.0,3.0,1,349909,21.0750,NaN,S
4,4,10,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
440,440,882,0.0,3.0,"Markun, Mr. Johann",male,33.0,0.0,0,349257,7.8958,NaN,S
441,441,884,0.0,2.0,"Banfield, Mr. Frederick James",male,28.0,0.0,0,C.A./SOTON 34068,10.5000,NaN,S
442,442,886,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5,382652,29.1250,NaN,Q
443,443,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
444,444,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,C

# 2) Drop unqualified variables

Drop unqualified variables

Drop variables with missing > 50%

Drop categorical variables with flat values > 70% (variables with the same value in the same column)

How many columns do we have left?

In [ ]:
half_missing = df.isnull().sum() > df.shape[0]/2
half_missing

Unnamed: 0     False
PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked       False
dtype: bool

In [416]:
df.columns[half_missing]

Index(['Cabin'], dtype='object')

In [417]:
df.drop(df.columns[half_missing], axis=1, inplace=True)
df.shape

(445, 12)

In [418]:
df['Age'].value_counts(normalize=True).max()
# 4.44% is age 24

np.float64(0.044444444444444446)

In [419]:
flat_cols = df.select_dtypes(include='object').apply(lambda col: col.value_counts(normalize=True).max() > 0.7)
flat_cols

Name        False
Sex         False
Ticket      False
Embarked     True
dtype: bool

In [420]:
flat_cols[flat_cols].index

Index(['Embarked'], dtype='object')

In [421]:
# df.drop(columns=flat_cols[flat_cols].index, inplace=True)
df.shape

(445, 12)

In [422]:
df

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C
1,1,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,S
2,2,6,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,Q
3,3,8,0.0,3.0,"Palsson, Master. Gosta Leonard",male,2.0,3.0,1,349909,21.0750,S
4,4,10,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,C
...,...,...,...,...,...,...,...,...,...,...,...,...
440,440,882,0.0,3.0,"Markun, Mr. Johann",male,33.0,0.0,0,349257,7.8958,S
441,441,884,0.0,2.0,"Banfield, Mr. Frederick James",male,28.0,0.0,0,C.A./SOTON 34068,10.5000,S
442,442,886,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5,382652,29.1250,Q
443,443,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,S
444,444,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C

# 3) Remove all rows with missing target (the variable "Survived")

Remove all rows with missing targets (the variable "Survived")

How many rows do we have left?

In [423]:
# df.dropna(subset=['Survived'], inplace=True)
df.shape

(445, 12)

# 4) Handle outliers 
Handle outliers

For the variable “Fare”, replace outlier values with the boundary values

If value < (Q1 - 1.5IQR), replace with (Q1 - 1.5IQR)

If value > (Q3 + 1.5IQR), replace with (Q3 + 1.5IQR)

What is the average (mean) of “Fare” after replacing the outliers (round 2 decimal points)?

Hint: Use function round(_, 2)

In [424]:
q25, q75 = np.percentile(df["Fare"], [25, 75])
iqr = q75 - q25

min_outlier = q25 - 1.5*iqr
max_outlier = q75 + 1.5*iqr

df.loc[df["Fare"] < min_outlier, "Fare"] = min_outlier
df.loc[df["Fare"] > max_outlier, "Fare"] = max_outlier

round(df["Fare"].mean(), 2)

df.reset_index(inplace=True)

In [425]:
df

,index,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,0,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C
1,1,1,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,S
2,2,2,6,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,Q
3,3,3,8,0.0,3.0,"Palsson, Master. Gosta Leonard",male,2.0,3.0,1,349909,21.0750,S
4,4,4,10,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
440,440,440,882,0.0,3.0,"Markun, Mr. Johann",male,33.0,0.0,0,349257,7.8958,S
441,441,441,884,0.0,2.0,"Banfield, Mr. Frederick James",male,28.0,0.0,0,C.A./SOTON 34068,10.5000,S
442,442,442,886,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5,382652,29.1250,Q
443,443,443,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,S
444,444,444,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C

# 5) Impute missing value

Impute missing value

For number type column, impute missing values with mean

What is the average (mean) of “Age” after imputing the missing values (round 2 decimal points)?

Hint: Use function round(_, 2)

In [426]:
null_counts = df.isnull().sum()
print("Number of null values in each column:\n{}".format(null_counts))

Number of null values in each column:
index           0
Unnamed: 0      0
PassengerId     0
Survived       13
Pclass         31
Name           12
Sex             0
Age            85
SibSp          17
Parch           0
Ticket         19
Fare            0
Embarked       45
dtype: int64

In [427]:
from sklearn.impute import SimpleImputer

num_imp = SimpleImputer(missing_values=np.nan, strategy='mean')
df[["Pclass", "Age", "SibSp"]] = pd.DataFrame(num_imp.fit_transform(df[["Pclass", "Age", "SibSp"]]))

In [428]:
null_counts = df.isnull().sum()
print("Number of null values in each column:\n{}".format(null_counts))

Number of null values in each column:
index           0
Unnamed: 0      0
PassengerId     0
Survived       13
Pclass          0
Name           12
Sex             0
Age             0
SibSp           0
Parch           0
Ticket         19
Fare            0
Embarked       45
dtype: int64

In [429]:
round(df["Age"].mean(), 2)

np.float64(29.14)

# 6) Convert categorical to numeric values

Convert categorical to numeric values

For the variable “Embarked”, perform the dummy coding.

What is the average (mean) of “Embarked_Q” after performing dummy coding (round 2 decimal points)?

Hint: Use function round(_, 2)

In [430]:
from sklearn.preprocessing import OneHotEncoder

enc = OneHotEncoder(handle_unknown='ignore') 
# passing bridge-types-cat column (label encoded values of bridge_types)
nominal_columns = ["Embarked"]
enc_df = pd.DataFrame(enc.fit_transform(df[nominal_columns]).toarray())
unique_vals = enc.categories_[0]
new_col_names = [f"Embarked_{val}" for val in unique_vals]
enc_df.columns = new_col_names
enc_df

     Embarked_C  Embarked_Q  Embarked_S  Embarked_nan
0           1.0         0.0         0.0           0.0
1           0.0         0.0         1.0           0.0
2           0.0         1.0         0.0           0.0
3           0.0         0.0         1.0           0.0
4           1.0         0.0         0.0           0.0
..          ...         ...         ...           ...
440         0.0         0.0         1.0           0.0
441         0.0         0.0         1.0           0.0
442         0.0         1.0         0.0           0.0
443         0.0         0.0         1.0           0.0
444         1.0         0.0         0.0           0.0

[445 rows x 4 columns]

In [431]:
df = pd.concat([df, enc_df], axis=1)
df

,index,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
0,0,0,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.2833,C,1.0,0.0,0.0,0.0
1,1,1,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.1000,S,0.0,0.0,1.0,0.0
2,2,2,6,0.0,3.0,"Moran, Mr. James",male,29.136361,0.0,0,330877,8.4583,Q,0.0,1.0,0.0,0.0
3,3,3,8,0.0,3.0,"Palsson, Master. Gosta Leonard",male,2.000000,3.0,1,349909,21.0750,S,0.0,0.0,1.0,0.0
4,4,4,10,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1.0,0,237736,30.0708,C,1.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
440,440,440,882,0.0,3.0,"Markun, Mr. Johann",male,33.000000,0.0,0,349257,7.8958,S,0.0,0.0,1.0,0.0
441,441,441,884,0.0,2.0,"Banfield, Mr. Frederick James",male,28.000000,0.0,0,C.A./SOTON 34068,10.5000,S,0.0,0.0,1.0,0.0
442,442,442,886,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0.0,5,382652,29.1250,Q,0.0,1.0,0.0,0.0
443,443,443,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.000000,0.0,0,112053,30.0000,S,0.0,0.0,1.0,0.0
444,444,444,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.000000,0.0,0,111369,30.0000,C,1.0,0.0,0.0,0.0

In [432]:
mean_embarked_q = round(enc_df["Embarked_Q"].mean(), 2)
mean_embarked_q

np.float64(0.06)

# 7) Partition data
Split train/test split with stratification using 70%:30% and random seed with 123

Show a proportion between survived (1) and died (0) in all data sets (total data, train, test)

What is the proportion of survivors (survived = 1) in the training data (round 2 decimal points)?

Hint: Use function round(_, 2), and train_test_split() from sklearn.model_selection

In [433]:
df["Survived"].mean()

np.float64(0.4166666666666667)

In [434]:
num_imp = SimpleImputer(missing_values=np.nan, strategy='mean')
df["Survived"] = pd.DataFrame(num_imp.fit_transform(df[["Survived"]]))
df["Survived"] = df["Survived"].apply(lambda x: 1.0 if x > 0.5 else 0.0)

In [435]:
df["Survived"].mean()

np.float64(0.4044943820224719)

In [436]:
from sklearn.model_selection import train_test_split

y = df.pop("Survived")
X = df

X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, test_size=0.3, random_state=123)

In [437]:
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(311, 16) (134, 16) (311,) (134,)

In [438]:
y_train

80     1.0
147    0.0
275    0.0
404    1.0
192    0.0
      ...
298    0.0
24     0.0
351    0.0
116    1.0
61     1.0
Name: Survived, Length: 311, dtype: float64

In [439]:
survived_train = y_train.sum() / y_train.shape[0]
survived_test = y_test.sum() / y_test.shape[0]

In [440]:
survived_train

np.float64(0.40514469453376206)

In [441]:
round(survived_train, 2)

np.float64(0.41)

In [351]:
survived_train = y_train.sum() / y_train.shape[0]
survived_test = y_test.sum() / y_test.shape[0]
print("Survived in train: {:.2f}%".format(survived_train * 100))
print("Survived in test: {:.2f}%".format(survived_test * 100))

survived_all = y.sum() / y.shape[0]
print("Survived in all: {:.2f}%".format(survived_all * 100))

Survived in train: 41.72%
Survived in test: 41.54%
Survived in all: 41.67%

In [319]:
null_counts = df.isnull().sum()
null_counts

index            0
Unnamed: 0       0
PassengerId      0
Survived        13
Pclass           0
Name            12
Sex              0
Age              0
SibSp            0
Parch            0
Ticket          19
Fare             0
Embarked        45
Embarked_C       0
Embarked_Q       0
Embarked_S       0
Embarked_nan     0
dtype: int64